Revit 2026 API

# FabricationPartSpoolName Property

---

The spool name of the fabrication part.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SpoolName { get; set; }
```
```vb
Public Property SpoolName As String
	Get
	Set
```
```cpp
public:
property String^ SpoolName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SpoolName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: |

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace